{
  "Dark/Light": "Ночь/День",
  "Shkvirskii Stanislav": "Шквирський Станислав",
  "Full stack developer": "Разработчик полного стека",
  "Phone": "Телефон",
  "Email": "Почта",
  "Interest": "Интересы",
  "Family": "Семья",
  "Coding": "Программить",
  "Fishing": "Рыбалка",
  "Cinema": "Кино",
  "Music": "Музыка",
  "Links": "Ссылки",
  "Last Progect": "Последний проэкт",
  "Experience": "Опыт",
  "Education": "Образование",
  "Hard Skills": "Навыки",
  "Location": "Адрес",
  "Ukraine, Dnipro": "Украина, Днепр",
  "About Me": "Обо мне",
  "My name is Stanislav, and I work as a full stack developer with more than two years of experience in the field of development.": "Меня зовут Станислав, и я Full stack developer с более чем двухлетним опытом работы в области разработки.",
  "I have confident skills in web development using C#, HTML, CSS, SCSS, JavaScript and TypeScript. Experience with Angular, Vue.js, ASP.NET and Blazor. I also have the skills to use SignalR to develop applications in real time.": "Есть уверенные навыки в веб-разработке, используя C#, HTML, CSS, SCSS, JavaScript и TypeScript. Опыт работы с Angular, Vue.js, ASP.NET и Blazor. Также владею навыками использования SignalR для разработки приложений в реальном времени.",
  "I have experience in using MAUI Blazor, capable of creating mobile applications using technologies from Microsoft, as well as experience with APIs from Google and Firebase.": "Имею опыт использования MAUI Blazor, способный создавать мобильные приложения с использованием технологий от Microsoft. Также опыт работы с API от Google и Firebase.",
  "I like learning new things, researching technological innovation and learning about best practices in development.": "Мне нравится учиться новому, исследовать технологические инновации и узнавать лучшие практики в области разработки.",
  "I am open to communication and ready to collaborate successfully with the development team to achieve common goals.": "Я открыт для общения и готов к успешному сотрудничеству с командой разработчиков для достижения общих целей.",
  "I set myself high work standards and am committed to continually improving my skills to become the best in my profession.": "Я ставлю перед собой высокие стандарты работы и стремлюсь к постоянному совершенствованию своих навыков, чтобы стать лучшим в своей профессии.",
  "For the last two years, I have successfully worked in the organization of 'Xanel' as a Full Stack Developer, improved my skills and accumulated experience in the technologies necessary for the successful work of a full stack developer.": "В течение последних двух лет я успешно работал в организации 'Xanel' как Full stack developer, совершенствовал свои навыки и накапливал опыт в технологиях, необходимых для успешной работы разработчика.",
  "My work often required the ability to work from idea to release, including all stages of development from design to testing and implementation. Always prioritized high quality and efficiency of code, confident that clean and optimized code is a key element of successful development. ": "Моя работа часто требовала умения работать от идеи до релиза, включая все этапы разработки от проектирования до тестирования и внедрения. Всегда отдавал приоритет высокому качеству и эффективности кода, уверен, что чистый и оптимизированный код является ключевым элементом успешной разработки.",
  "My work included not only the implementation of web applications, but also their further improvement and optimization. I was actively involved in ensuring effective interaction between the frontend and backend, developing and improving the functionality in accordance with the requirements and expectations of users.": "Моя работа включала в себя не только реализацию веб-приложений, но и их дальнейшее совершенствование и оптимизацию. Я был активно задействован в обеспечении эффективного взаимодействия между фронтендом и бэкендом, разрабатывая и совершенствуя функционал в соответствии с требованиями и ожиданиями пользователей.",
  "My task was to find and implement optimal solutions for achieving the best results.": "Моя задача заключалась в поиске и внедрении оптимальных решений для достижения наилучших результатов.",
  "In general, my work in the field of Full Stack Development has been an integral part of my professional growth, allowing me not only to fulfill the requirements of projects, but also to make my own contribution to the development and improvement of web technologies.": "В целом, моя работа в сфере разработки полного стека была неотъемлемой частью моего профессионального роста, позволяя мне не только реализовывать требования проектов, но и вносить свой вклад в развитие и совершенствование веб-технологий.",
  "English language courses": "Курсы английского языка",
  "DSAEU, 'Processes machines and equipment'": "ДГАЭУ, 'Процессы машины и оборудования'",
  "The .NET Developer course gave me the opportunity to gain practical experience in developing websites and applications from scratch and based on ready-made solutions. I gained a lot of experience in performing tasks and projects, working both independently and in a team. I am ready to contribute to the development of high-quality web applications and products.": "Курс .NET Developer дал мне возможность получить практический опыт в разработке веб-сайтов и приложений с нуля и на базе готовых решений. Я получил большой опыт в выполнении задач и проектов, работая как самостоятельно, так и в команде. Я готов внести свой вклад. в разработку высококачественных веб-приложений и продуктов.",
  "The Pre-Intermediate English course provided skills for confident communication. Developed language comprehension and improved reading, writing, speaking and listening skills.": "Курс английского языка на уровне Pre-Intermediate предоставил навыки для уверенного общения. Развивал понимание языка и улучшал навыки чтения, письма, разговора и слушания.",
  "After successfully completing my studies at the Faculty 'Processes of Machinery and Equipment' of Dnipropetrovsk State University, I received a high-quality education and significant professional skills in the field of mechanical engineering and equipment. My education provided deep knowledge and prepared me for the challenges associated with technical innovation and engineering. My logical thinking, developed during my studies, turns out to be a great advantage in my work as a programmer.": "После успешного завершения обучения на факультете 'Процессы машины и оборудования' Днепропетровского государственного университета, я получил высококачественное образование и значительные профессиональные навыки в области машиностроения и оборудования. Мое образование дало глубокие знания и подготовило меня к вызовам, связанным с техническими инновациями и инженерной мое логическое мышление, развитое во время учебы, оказывается большим преимуществом в моей работе программиста."
}
