{
  "Dark/Light": "Нiчь/День",
  "Shkvirskii Stanislav": "Шквiрський Станiслав",
  "Phone": "Телефон",
  "Email": "Пошта",
  "Interest": "Інтереси",
  "Family": "Сім'я",
  "Coding": "Програмувати",
  "Fishing": "Риболовля",
  "Cinema": "Кiно",
  "Music": "Музика",
  "Links": "Посилання",
  "Last Progect": "Останній проект",
  "Experience": "Досвід",
  "Hard Skills": "Навички",
  "Education": "Освіта",
  "Location": "Адреса",
  "Ukraine, Dnipro": "Україна, Дніпро",
  "About Me": "Про мене",
  "My name is Stanislav, and I work as a full stack developer with more than two years of experience in the field of development.": "Мене звуть Станіслав, і я Full stack developer із більш ніж дворічним досвідом роботи в галузі розробки.",
  "I have confident skills in web development using C#, HTML, CSS, SCSS, JavaScript and TypeScript. Experience with Angular, Vue.js, ASP.NET and Blazor. I also have the skills to use SignalR to develop applications in real time.": "Маю впевнені навички у веб-розробці, використовуючи C#, HTML, CSS, SCSS, JavaScript і TypeScript. Досвід роботи з Angular, Vue.js, ASP.NET та Blazor. Також володію навичками використання SignalR для розробки додатків у реальному часі.",
  "I have experience in using MAUI Blazor, capable of creating mobile applications using technologies from Microsoft, as well as experience with APIs from Google and Firebase.": "Маю досвід у використанні MAUI Blazor, здатний створювати мобільні додатки з використанням технологій від Microsoft.Також досвід роботи з API від Google та Firebase.",
  "I like learning new things, researching technological innovation and learning about best practices in development.": "Мені подобається вчитися новому, досліджувати технологічні інновації та дізнаватися про найкращі практики в галузі розробки.",
  "I am open to communication and ready to collaborate successfully with the development team to achieve common goals.": "Я відкритий до спілкування та готовий до успішної співпраці з командою розробників для досягнення спільних цілей.",
  "I set myself high work standards and am committed to continually improving my skills to become the best in my profession.": "Я ставлю перед собою високі стандарти роботи та прагну до постійного удосконалення своїх навичок, щоб стати кращим у своїй професії.",
  "For the last two years, I have successfully worked in the organization of 'Xanel' as a Full Stack Developer, improved my skills and accumulated experience in the technologies necessary for the successful work of a full stack developer.": "Протягом останiх двох рокiв я успішно працював в органiзацii 'Xanel' як Full stack developer, вдосконалював свої навички та накопичував досвід у технологіях, необхідних для успішної роботи розробника.",
  "My work often required the ability to work from idea to release, including all stages of development from design to testing and implementation. Always prioritized high quality and efficiency of code, confident that clean and optimized code is a key element of successful development.": "Моя робота часто вимагала вміння працювати від ідеї до релізу, включаючи усі етапи розробки від проектування до тестування та впровадження. Завжди надавав пріоритет високій якості та ефективності коду, впевнений, що чистий та оптимізований код є ключовим елементом успішної розробки.",
  "My work included not only the implementation of web applications, but also their further improvement and optimization. I was actively involved in ensuring effective interaction between the frontend and backend, developing and improving the functionality in accordance with the requirements and expectations of users.": "Моя робота включала в себе не лише реалізацію веб-додатків, а й їх подальше вдосконалення та оптимізацію. Я був активно задіяний у забезпеченні ефективної взаємодії між фронтендом та бекендом, розробляючи та вдосконалюючи функціонал відповідно до вимог та очікувань користувачів.",
  "My task was to find and implement optimal solutions for achieving the best results.": "Моє завдання полягало в пошуку та впровадженні оптимальних рішень для досягнення найкращих результатів.",
  "In general, my work in the field of Full Stack Development has been an integral part of my professional growth, allowing me not only to fulfill the requirements of projects, but also to make my own contribution to the development and improvement of web technologies.": "Загалом, моя робота в сфері розробки повного стеку була невід'ємною частиною мого професійного зростання, дозволяючи мені не лише реалізовувати вимоги проектів, а й вносити власний вклад у розвиток та вдосконалення веб-технологій.",
  "English language courses": "Курси англійської мови",
  "DSAEU, 'Processes machines and equipment'": "ДДАЕУ, 'Процесси машини та обладнання'",
  "The .NET Developer course gave me the opportunity to gain practical experience in developing websites and applications from scratch and based on ready-made solutions. I gained a lot of experience in performing tasks and projects, working both independently and in a team. I am ready to contribute to the development of high-quality web applications and products.": "Курс .NET Developer дав мені можливість отримати практичний досвід у розробці веб-сайтів та додатків з нуля та на базі готових рішень. Я здобув великий досвід у виконанні завдань та проектів, працюючи як самостійно, так і в команді. Я готовий внести свій внесок у розробку високоякісних веб-додатків та продуктів.",
  "The Pre-Intermediate English course provided skills for confident communication. Developed language comprehension and improved reading, writing, speaking and listening skills.": "Курс англійської мови на рівні Pre-Intermediate надав навичок для впевненого спілкування. Розвивав розуміння мови та покращував навички читання, письма, розмови та слухання.",
  "After successfully completing my studies at the Faculty 'Processes of Machinery and Equipment' of Dnipropetrovsk State University, I received a high-quality education and significant professional skills in the field of mechanical engineering and equipment. My education provided deep knowledge and prepared me for the challenges associated with technical innovation and engineering. My logical thinking, developed during my studies, turns out to be a great advantage in my work as a programmer.": "Після успішного завершення навчання на факультеті 'Процеси машини та обладнання' Дніпропетровського державного університету, я отримав високоякісну освіту та значні фахові навички в галузі машинобудування та обладнання. Моя освіта дала глибокі знання і підготувала мене до викликів, пов'язаних із технічними інноваціями та інженерною діяльністю. Моє логічне мислення, розвинуте під час навчання, виявляється великою перевагою у моїй роботі програміста."
}
